{
    "fullName": "Todd Austin",
    "title": "Professor, EECS, University of Michigan",
    "addressRoom": "4637 BBB",
    "addressStreet": "2260 Hayward Avenue ",
    "addressZip": "Ann Arbor, MI 48109-2121",
    "phoneNumber": "734-936-0370",
    "email": "austin@umich.edu",
    "googleScholarLink": "https://scholar.google.com/citations?user=B8O_SVkAAAAJ&hl=en&oi=ao",
    "linkedInLink": "https://www.linkedin.com/in/prof-todd-austin/",
    "twitterLink": "https://twitter.com/ToddMAustin",
    "githubLink": "",
    "youTubeLink": "https://www.youtube.com/channel/UCWMP5vDBsJFZUDk34ADUwRw",
    "personalBiography": "Todd Austin is a Professor of Electrical Engineering and Computer Science at the University of Michigan in Ann Arbor. His research interests include computer architecture, robust and secure system design, hardware and software verification, and performance analysis tools and techniques. Currently Todd is director of C-FAR, the Center for Future Architectures Research, a multi-university SRC/DARPA funded center that is seeking technologies to scale the performance and efficiency of future computing systems. Prior to joining academia, Todd was a Senior Computer Architect in Intel's Microcomputer Research Labs, a product-oriented research laboratory in Hillsboro, Oregon. Todd is the first to take credit (but the last to accept blame) for creating the SimpleScalar Tool Set, a popular collection of computer architecture performance analysis tools. Todd is co-author (with Andrew Tanenbaum) of the undergraduate computer architecture textbook, \"Structured Computer Architecture, 6th Ed.\"  In addition to his work in academia, Todd is co-founder of SimpleScalar LLC and InTempo Design LLC.  In 2002, Todd was a Sloan Research Fellow, and in 2007 he received the ACM Maurice Wilkes Award for \"innovative contributions in Computer Architecture including the SimpleScalar Toolkit and the DIVA and Razor architectures.\" Todd is an IEEE Fellow, and he received his Ph.D. in Computer Science from the University of Wisconsin in 1996."
}